test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-samba/1000.log
2025/07/05 15:40:25 Function mode: SINGLE
{"level":"info","ts":1751730025.5958707,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/05 15:40:25 Starting func invocation probe for target: appender-ego
2025/07/05 15:40:25 Using rate: 1000
2025/07/05 15:45:55 Shutting down InfluxReporter
Requests      [total, rate, throughput]         299986, 999.88, 908.98
Duration      [total, attack, wait]             5m30s, 5m0s, 30.001s
Latencies     [min, mean, 50, 90, 95, 99, max]  12.304ms, 20.65ms, 19.36ms, 26.385ms, 28.953ms, 45.551ms, 30.001s
Bytes In      [total, mean]                     326083695, 1087.00
Bytes Out     [total, mean]                     329983500, 1100.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      0:1  200:299985  
Error Set:
Post "http://appender-ego.default.svc.cluster.local": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
2025/07/05 15:45:55 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 28.953207ms