test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-samba/1250.log
2025/07/05 15:46:16 Function mode: SINGLE
{"level":"info","ts":1751730376.5478313,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/05 15:46:16 Starting func invocation probe for target: appender-ego
2025/07/05 15:46:16 Using rate: 1250
2025/07/05 15:51:46 Shutting down InfluxReporter
Requests      [total, rate, throughput]         374999, 1250.00, 1136.34
Duration      [total, attack, wait]             5m30s, 5m0s, 30.001s
Latencies     [min, mean, 50, 90, 95, 99, max]  12.069ms, 32.669ms, 22.119ms, 52.118ms, 93.097ms, 208.988ms, 30.001s
Bytes In      [total, mean]                     407618478, 1086.99
Bytes Out     [total, mean]                     412493400, 1099.99
Success       [ratio]                           100.00%
Status Codes  [code:count]                      0:5  200:374994  
Error Set:
Post "http://appender-ego.default.svc.cluster.local": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
2025/07/05 15:51:46 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 93.096834ms