test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-samba/250.log
2025/07/05 15:23:52 Function mode: SINGLE
{"level":"info","ts":1751729032.9222414,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/05 15:23:53 Starting func invocation probe for target: appender-ego
2025/07/05 15:23:53 Using rate: 250
2025/07/05 15:28:53 Shutting down InfluxReporter
Requests      [total, rate, throughput]         75000, 250.00, 249.98
Duration      [total, attack, wait]             5m0s, 5m0s, 30.739ms
Latencies     [min, mean, 50, 90, 95, 99, max]  12.388ms, 27.949ms, 27.898ms, 33.418ms, 35.297ms, 39.992ms, 214.8ms
Bytes In      [total, mean]                     81525000, 1087.00
Bytes Out     [total, mean]                     82500000, 1100.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:75000  
Error Set:
2025/07/05 15:28:53 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 35.296624ms